N = int(input())

# ex  N = 2 N + 1 = 3 0, 1, 2

# 이게 규칙
# 입력이 2 이상 일때
# 3이상 부터 전에 출력했던 값을 감쌈.

# 짝수일경우랑 홀수일 경우로 나누면됨
# 우선 짝수일 경우 2, 4 에서는
# 맨 위에가 닫혀 있는 모양부터 시작함
# 반대로 홀수일 경우 삼각형을 쌓음
# 맨 위줄 0 ~ 28개 총 29개
# 4 일때 15개
# 3 일때 7개
# 2 일때 3

# 짝수일때는 N*N-1
# 홀수일때는 N*N-2

# 먼저 N 이 짝수라면
# 별부터 출력

# N 이 홀수 라면 공백부터 출력
if (N % 2 == 0):
    for i in range((N * N - 1)):
        if (i == 0):
            # 29 - 16
            print("*" * ((N * N) + 13))
        elif (i == 1):
            print(" " * i + "*" + " " * ((N * N) - ((i + 1) * 2)) + "*" + " " *
                  (2 * i - 3) + " " * ((N * N) - ((i + 1) * 2)) + "*")
        elif (1 < i < 4):
            print(" " * i + "*" + " " * ((N * N) - ((i + 1) * 2)) + "*" + " " *
                  (2 * i - 3) + "*" + " " * ((N * N) - ((i + 1) * 2)) + "*")

        elif (i == 4):
            print(" " * i + "*" + " " * ((N * N) - ((i + 1) * 2)) + "*" + "*" *
                  (i * 2 - 3) + "*" + " " * ((N * N) - ((i + 1) * 2)) + "*")

    # 5, 3, 2 d 2 a + (n-1) * d
    # 5, 6
    # (i*2 - 7) = 3
    # (i*2) - i - 2 = 1
    # 16 - 10 - 3 = 3
    # 16 - 12 - 3 = 4
        elif (4 < i < 7):
            print(" " * i + "*" + " " * ((N * N) - ((i + 1) * 2)) + "*" + " " *
                  (i * 2 - 8) + "*" * ((N * N) - (i * 2) - 3) + " " *
                  (i * 2 - 8) + "*" + " " * ((N * N) - ((i + 1) * 2)) + "*")

        elif (i == 7):
            print(" " * i + "*" + " " * ((N * N) - ((i + 1) * 2)) + "*" + "*" *
                  (2 * i - 3) + "*" + " " * ((N * N) - ((i + 1) * 2)) + "*")

    # 11 - 9 - 7 - 5 - 3 - 1 
          # 
        elif (i > 7):
            print(" " * i + "*" + " " * () + "*")
else:
    # ex = 3
    # 7개 0, 1, 2, 3, 4, 5, 6
    # (N*N)-j-3
    for j in range((N * N - 2)):
        if (j == 0):
            print(" " * ((N * N) - j - 3) + "*")
        elif (0 < j < 3):
            print(" " * ((N * N) - j - 3) + "*" + " " * (2 * j - 1) + "*")
        elif (j == 3):
            print(" " * ((N * N) - j - 3) + "*" + "*" * (2 * j - 1) + "*")
        elif (3 < j < 6):
            print(" " * ((N * N) - j - 3) + "*" + " " * ((j * 2) - 6) + "*" *
                  ((N * N) - (j * 2) + 2) + " " * ((j * 2) - 6) + "*")
        elif (j == (N * N - 3)):
            print(" " * ((N * N) - j - 3) + "*" + "*" * ((N * N) + 2) + "*")
